<a href="https://colab.research.google.com/github/JonRivera/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [8]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-06-03 20:04:19--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.32.134
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.32.134|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  84.2MB/s    in 2.3s

2020-06-03 20:04:21 (84.2 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [9]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [10]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [11]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

**#SOLUTION:**

Banana                    491291

Bag of Organic Bananas    394930

Organic Strawberries      275577

Organic Baby Spinach      251705

Organic Hass Avocado      220877

Organic Avocado           184224

Large Lemon               160792

Strawberries              149445

Limes                     146660

Organic Whole Milk        142813



**#Work is Shown Below**

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [1]:
#picture for future reference
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*vYGFQCafJtGBBX5mbl0xyw.png'
example = Image(url=url, width=600)

display(example)

In [12]:
##### YOUR CODE HERE #####
# I am going to need to find the column that gives me the number of ordered products
# for each customer
# I need the data frame that contains thse products names
# I need to somehow bridge information 
# I am going to load all the csv files to find the dataframes I need, and slim
#data wherever possible
# Recall the order prior contains the historical purchases of the customer
# Recall the order train data set contains the very last order of the customers.

import pandas as pd

aisles = pd.read_csv('aisles.csv')
aisles.head(5)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [0]:
#department data frame not needed
departments = pd.read_csv('departments.csv')
departments.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [0]:
#this data frame will be the bridge between orders and products as it contains
#both product id and order id columnss
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__prior.head(5)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [17]:
#reference pic to see what to drop
display(example)

In [0]:
#drop reordered,not needed
order_products__prior = order_products__prior.drop("reordered",axis=1)

In [0]:
order_products__prior

          order_id  product_id  add_to_cart_order
0                2       33120                  1
1                2       28985                  2
2                2        9327                  3
3                2       45918                  4
4                2       30035                  5
...            ...         ...                ...
32434484   3421083       39678                  6
32434485   3421083       11352                  7
32434486   3421083        4600                  8
32434487   3421083       24852                  9
32434488   3421083        5020                 10

[32434489 rows x 3 columns]

In [0]:
#same columns as order_products__prior so
#eventually we might need to concatenate with it
order_products__train = pd.read_csv('order_products__train.csv')
order_products__train.head(5)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [4]:
#compare to see what to drop
#reordered column not needed
display(example)

In [0]:
#drop reordered column
order_products__train = order_products__train.drop("reordered",axis=1)

In [0]:
order_products__train

         order_id  product_id  add_to_cart_order
0               1       49302                  1
1               1       11109                  2
2               1       10246                  3
3               1       49683                  4
4               1       43633                  5
...           ...         ...                ...
1384612   3421063       14233                  3
1384613   3421063       35548                  4
1384614   3421070       35951                  1
1384615   3421070       16953                  2
1384616   3421070        4724                  3

[1384617 rows x 3 columns]

In [13]:
orders = pd.read_csv('orders.csv')
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [5]:
display(example)

In [0]:
#drop eval_set, its not needed
orders = orders.drop("eval_set",axis=1)

In [16]:
orders

         order_id  user_id  ...  order_hour_of_day  days_since_prior_order
0         2539329        1  ...                  8                     NaN
1         2398795        1  ...                  7                    15.0
2          473747        1  ...                 12                    21.0
3         2254736        1  ...                  7                    29.0
4          431534        1  ...                 15                    28.0
...           ...      ...  ...                ...                     ...
3421078   2266710   206209  ...                 18                    29.0
3421079   1854736   206209  ...                 10                    30.0
3421080    626363   206209  ...                 12                    18.0
3421081   2977660   206209  ...                 12                     7.0
3421082    272231   206209  ...                 14                    30.0

[3421083 rows x 6 columns]

In [0]:
products = pd.read_csv('products.csv')

In [0]:
products.head(10)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13
5           6  ...            11
6           7  ...             7
7           8  ...             1
8           9  ...            16
9          10  ...             7

[10 rows x 4 columns]

In [2]:
#reference pic to see which columns to drop
display(example)

In [0]:
#isle_id and_deparment_id aren't needed
products = products.drop('department_id', axis=1)
products = products.drop('aisle_id', axis=1)

In [0]:
products

       product_id                                       product_name
0               1                         Chocolate Sandwich Cookies
1               2                                   All-Seasons Salt
2               3               Robust Golden Unsweetened Oolong Tea
3               4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4               5                          Green Chile Anytime Sauce
...           ...                                                ...
49683       49684          Vodka, Triple Distilled, Twist of Vanilla
49684       49685                 En Croute Roast Hazelnut Cranberry
49685       49686                                   Artisan Baguette
49686       49687         Smartblend Healthy Metabolism Dry Cat Food
49687       49688                             Fresh Foaming Cleanser

[49688 rows x 2 columns]

In [0]:
#First were going to concatenate orders_pior and orders_train to see all the orders
# of the customer
#Upto now we have slim unecessary columns wherever possible

order_products = pd.concat([order_products__prior,order_products__train])
order_products = order_products.sort_values('add_to_cart_order', ascending= False)

In [0]:
# were going to use order_products as a link to combine orders and products

order_products.head(27)

          order_id  product_id  add_to_cart_order
14825330   1564244       23737                145
14825329   1564244       43182                144
14825328   1564244       21230                143
14825327   1564244       22594                142
14825326   1564244       46346                141
14825325   1564244       19019                140
14825324   1564244       21616                139
14825323   1564244       26940                138
14825322   1564244       18090                137
7492555     790903       33572                137
7492554     790903       23765                136
14825321   1564244       28535                136
7492553     790903       23029                135
14825320   1564244       25670                135
14825319   1564244       16521                134
7492552     790903       33975                134
7492551     790903       31663                133
14825318   1564244        9896                133
7492550     790903       17638                132
14825317   1564244       41338                132
7492549     790903        1935                131
14825316   1564244       20943                131
7492548     790903       28398                130
14825315   1564244        1087                130
14825314   1564244       19706                129
7492547     790903       11777                129
7492546     790903       48220                128

In [0]:
# merge orders and products data frames
order_and_products = pd.merge(orders, order_products)

In [0]:
order_and_products.head()

   order_id  user_id  ...  product_id  add_to_cart_order
0   2539329        1  ...       26405                  5
1   2539329        1  ...       26088                  4
2   2539329        1  ...       12427                  3
3   2539329        1  ...       14084                  2
4   2539329        1  ...         196                  1

[5 rows x 8 columns]

In [0]:
final = pd.merge(order_and_products, products, how='inner', on= 'product_id')

In [0]:
final.head()

   order_id  user_id  ...  add_to_cart_order                      product_name
0   2539329        1  ...                  5  XL Pick-A-Size Paper Towel Rolls
1   2254736        1  ...                  5  XL Pick-A-Size Paper Towel Rolls
2   1187899        1  ...                  4  XL Pick-A-Size Paper Towel Rolls
3   2999662       92  ...                  8  XL Pick-A-Size Paper Towel Rolls
4   2210120       98  ...                  3  XL Pick-A-Size Paper Towel Rolls

[5 rows x 9 columns]

In [0]:
#top 10 products 
final['product_name'].value_counts().head(10)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [0]:
# tidy -> table2
#Begin by changing the index from names to numbers
table2 = table2.reset_index()

In [0]:

table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [0]:
tidy = table2.melt(id_vars='index',value_vars=['John Smith','Jane Doe', 'Mary Johnson'])

In [0]:
 # specify the unique identifiers
 # Now it is in tidy format
tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [0]:
tidy = tidy.rename(columns={'variable': 'name'})
tidy

        index          name  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [0]:
#Now use pivot to inverse the tidy data format
wide = tidy.pivot_table(index='index', columns ='name', values='value')

In [0]:
wide

name        Jane Doe  John Smith  Mary Johnson
index
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [0]:
#renaming the index name to an empty string
wide.index.names = [""]
wide

name        Jane Doe  John Smith  Mary Johnson

treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [0]:
#were back to wide format
wide.columns.names = [""]
wide

            Jane Doe  John Smith  Mary Johnson

treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [0]:
import seaborn as sns; sns.set(style="ticks", color_codes=True)
flights = sns.load_dataset('flights')
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [0]:
# Flights Pivot Table

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####